** Functions returning functions, oh my

So, right now we have an equation object, which consists of a text string describing the function, and the constituent polynomials. We need to convert this into a function which can be applied to the input data (i.e. guess). 

#+BEGIN_SRC R :session :results none
expression_to_function <- function(expression) {
    return(function(x) {
        res <-   polynomial@coefficient  * x ^(polynomial@exponent)
    })}
#+END_SRC

So, that was easier than expected. It's going to break unless I make some changes to my code though. I need to set the exponent value to 1, where it doesn't exist. Currently, I believe it will take zero, which will cause incorrect answers. 

Let's make sure it doesn't work. 

#+BEGIN_SRC R :session :results output :exports both
poly_wrong <- to_polynomial("20x")
wrong_func <- polynomial_to_function(poly_wrong)
r <- wrong_func(1) #should be 20, will be zero
print(r)
#+END_SRC

#+RESULTS:
: var is: x
: coeff is: 20
: [1] 20

Hmmm, it appears that I was incorrect. Weird. 

#+BEGIN_SRC R :session :results none
equation_to_function <- function(equation) {
    string <- equation@text
    diff <- lapply(equation@members, differentiate)
}
#+END_SRC


So, I should write some utility methods. S4 is strict and everything, but you can completely ignore all of the validity checks just by using ~@~ [fn:1]. Luckily, I would never do that, and hence why I'm writing some extractor functions. 

#+BEGIN_SRC R :session :results none :tangle polynomial/R/polynomial.R
##' @export
setGeneric("exponent", function(object, ...) {
    standardGeneric("exponent")
})
##' @export
setGeneric("variable", function(object, ...) {
    standardGeneric("variable")
})
##' @export
exponent <- function(obj, ...) {
    standardGeneric("exponent", fdef=exp_poly)
}
##' @export
exp_poly <- function(expression) {
    exp <- expression@exponent

}
##' @export
var_poly <- function(expression) {
    expression@var
}
##' @export
coef_expression <- function(object, ...) {
    object@coefficient
}
##' A coefficient method for Polynomial objects
##'
##' As above
##' @export
setMethod("coef",
    signature(object = "Expression"),
    definition=coef_expression
)

#+END_SRC

Everytime I write this boilerplate, I die a little. 
** Handling Operators for Polynomials

So, we have two major classes defined here. The first ~Expression~ represents a component of a ~Polynomial~ which consists of one or more expression objects expressed as an equation. 

Currently, ~Polynomials~ look like this. 

#+BEGIN_SRC R :session  :results output
print(getClass ("Polynomial"))

#+END_SRC

#+RESULTS:
: Class "Polynomial" [package "polynomial"]
: 
: Slots:
:                           
: Name:       text   members
: Class: character      list

What it needs is a third component, operators which contain a vector of addition/subtraction operators. These can then be used to recombine the elements (for printing), or to arrange the functions so that we can finally finish our gradient descent. 

